Revit 2026 API

# ParameterGetAssociatedGlobalParameter Method

---

Returns a global parameter, if any, currently associated with this parameter.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public ElementId GetAssociatedGlobalParameter()
```
```vb
Public Function GetAssociatedGlobalParameter As ElementId
```
```cpp
public:
ElementId^ GetAssociatedGlobalParameter()
```
```fsharp
member GetAssociatedGlobalParameter : unit -> ElementId
```

#### Return Value

ElementId Id of a global parameter or InvalidElemetnId.

| Exception | Condition |
| --- | --- |
| ArgumentException | This parameter does not exist in the document anymore. |

InvalidElementId is returned in case this parameter is not associated with any global parameter. InvalidElementId is also returned if called for a parameter that cannot even be associated with a global parameters (i.e. a non-parametrizable parameter or parameter with a formula).

#### Reference

Parameter Class

Autodesk.Revit.DB Namespace